// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]


Console.Clear();
int[] arr = new int[8] {10, 20, 30, 40, 50, 60, 70, 80};

for (int i = 0; i < arr.Length; i++)
{
    Console.WriteLine(arr[i]);
}
